#include <iostream>
#include <cmath>

using namespace std;

int main() {
    double x, y;

    // Введення значень x та y від користувача
    cout << "Введіть значення x: ";
    cin >> x;

    cout << "Введіть значення y: ";
    cin >> y;

    // Область визначення: дільник кореня не може дорівнювати 0 або бути від'ємним
    if ((3 * y + 1) <= 0 || (1 - 9 * y * y) <= 0) {
        cout << "Область визначення не виконується (дільник кореня менше або дорівнює 0)." << endl;
        return 1;  // Вихід з програми з помилкою
    }

    // Обчислення значення виразу
    double result = sqrt(sqrt((x + 2) / (3 * y + 1)) + (8 * pow(x, 2) + 3) / (1 - 9 * pow(y, 2)));

    // Виведення результату
    cout << "Значення виразу: " << result << endl;

    return 0;
}
